# PANDAS ASSIGNMENT

In [95]:
import pandas as pd
import numpy as np

In [96]:
#1.Create and display a one-dimensional array-like object containing an array of data.

In [97]:
data = pd.Series([11,22,33,44,55,66,77])
print(data)

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64

In [98]:
#2.Convert a Panda module Series to Python list and itâ€™s type.

In [99]:
data = pd.Series([11,22,33,44,55,66,77])
l1 = data.tolist()
print(data)
print(f"Type of l1 = {type(data)}\n")
print(l1)
print(f"Type of l1 = {type(l1)}")

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64
Type of l1 = <class 'pandas.core.series.Series'>

[11, 22, 33, 44, 55, 66, 77]
Type of l1 = <class 'list'>

In [100]:
#3.Add, subtract, multiple and divide two Pandas Series.

In [101]:
data1 = pd.Series([2,4,6,8,10])
data2 = pd.Series([1,3,5,7,9])
print(f"Addition of two series is : \n{data1+data2}\n")
print(f"Substraction of two series is : \n{data1-data2}\n")
print(f"Multiplication of two series is : \n{data1*data2}\n")
print(f"Division of two series is : \n{data1/data2}\n")

Addition of two series is :
0     3
1     7
2    11
3    15
4    19
dtype: int64

Substraction of two series is :
0    1
1    1
2    1
3    1
4    1
dtype: int64

Multiplication of two series is :
0     2
1    12
2    30
3    56
4    90
dtype: int64

Division of two series is :
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [102]:
#4.Convert a dictionary to a Pandas series.

In [103]:
dict1 = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
print(dict1)
print(f"Type of Dictionary = {type(dict1)}\n")
series = pd.Series(dict1)
print(series)
print(f"Type of series = {type(series)}")

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Type of Dictionary = <class 'dict'>

a    100
b    200
c    300
d    400
e    800
dtype: int64
Type of series = <class 'pandas.core.series.Series'>

In [104]:
#5.Convert a NumPy array to a Pandas series.

In [105]:
numpy_arr = np.array([10, 20, 30, 40, 50])
print(numpy_arr)
print(f"Type of numpy array = {type(numpy_arr)}\n")
series = pd.Series(numpy_arr)
print(series)
print(f"Type of series = {type(series)}")

[10 20 30 40 50]
Type of numpy array = <class 'numpy.ndarray'>

0    10
1    20
2    30
3    40
4    50
dtype: int64
Type of series = <class 'pandas.core.series.Series'>

In [106]:
#6.Change the data type of given a column or a Series.

In [107]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
        'Age': [25, 30, 35, 40, 45],
        'Salary': [50000, 60000, 70000, 80000, 90000]}

df = pd.DataFrame(data)
print("Original data types:")
print(df.dtypes)
df['Age'] = df['Age'].astype('float64')
df['Salary'] = df['Salary'].astype('int64')
print("\nUpdated data types:")
print(df.dtypes)

Original data types:
Name      object
Age        int64
Salary     int64
dtype: object

Updated data types:
Name       object
Age       float64
Salary      int64
dtype: object

In [108]:
#7.Convert a given Series to an array.

In [109]:
series = pd.Series([1, 2, 3, 4, 5])
array = series.to_numpy()

print("Pandas Series:")
print(series)
print("\nNumPy Array:")
print(array)
print("\nType of array:", type(array))

Pandas Series:
0    1
1    2
2    3
3    4
4    5
dtype: int64

NumPy Array:
[1 2 3 4 5]

Type of array: <class 'numpy.ndarray'>

In [110]:
#8.Create a dataframe from a dictionary and display it.

In [111]:
data = {
    'Name': ['Ramya', 'Aabhay', 'Harsh', 'Mayuresh', 'Saurabh', 'Sudarshan'],
    'Age': [25, 23, 25, 25, 23, 24],
    'Salary': [80000, 60000, 70000, 80000, 55000, 65000]
}
df = pd.DataFrame(data)
print(df)

        Name  Age  Salary
0      Ramya   25   80000
1     Aabhay   23   60000
2      Harsh   25   70000
3   Mayuresh   25   80000
4    Saurabh   23   55000
5  Sudarshan   24   65000

In [112]:
#   9 .i) Create a list of empids and names (10 employees).
    # ii) Convert list into Series.
    #iii) Print type of Series.
    # iv) Convert Series into DataFrame.
    #  v) a) Display all records.
    #     b) Display first five records.
    #     c) Display last five records.
    #     d) Display first two and last two records.
    #     e) Display name of 5th employee.
    #     f) Display record of 4th employee.
    # vi) Save the record in csv file (MyRecord.csv)

In [113]:
empids = [701, 702, 703, 704, 705, 706, 707, 708, 709, 710]
names = ['Abhay', 'Pranav', 'Omkar', 'Sandesh', 'Mayuresh', 'Rutuja', 'Ankita', 'Muskan', 'Aniket', 'Jitendra']
emp_series = pd.Series(names, index=empids)
print(emp_series)

print("\nType of Series:", type(emp_series))
print('\n')

emp_df = pd.DataFrame({'Name': emp_series})
print(emp_df)
print('\n')

print(emp_df.head())
print('\n')

print(emp_df.tail())
print('\n')

print(emp_df.head(2))
print('\n')

print(emp_df.tail(2))
print('\n')

print(emp_df.iloc[4]['Name'])
print('\n')

print(emp_df.loc[704])
print('\n')

emp_df.to_csv('MyRecord.csv', index=False)

701       Abhay
702      Pranav
703       Omkar
704     Sandesh
705    Mayuresh
706      Rutuja
707      Ankita
708      Muskan
709      Aniket
710    Jitendra
dtype: object

Type of Series: <class 'pandas.core.series.Series'>


         Name
701     Abhay
702    Pranav
703     Omkar
704   Sandesh
705  Mayuresh
706    Rutuja
707    Ankita
708    Muskan
709    Aniket
710  Jitendra


         Name
701     Abhay
702    Pranav
703     Omkar
704   Sandesh
705  Mayuresh


         Name
706    Rutuja
707    Ankita
708    Muskan
709    Aniket
710  Jitendra


       Name
701   Abhay
702  Pranav


         Name
709    Aniket
710  Jitendra


Mayuresh


Name    Sandesh
Name: 704, dtype: object

In [114]:
#10. i) Read the MyRecord.csv file.
     #ii) Create a new column Salary.

In [115]:
emp1_df = pd.read_csv('MyRecord.csv')
emp1_df['Salary'] = [50000, 55000, 60000, 65000, 70000, 75000, 80000, 85000, 90000, 95000]
print(emp1_df)

       Name  Salary
0     Abhay   50000
1    Pranav   55000
2     Omkar   60000
3   Sandesh   65000
4  Mayuresh   70000
5    Rutuja   75000
6    Ankita   80000
7    Muskan   85000
8    Aniket   90000
9  Jitendra   95000

In [116]:
#11.i) Read the dataset "Advertising.csv" in data frame.

In [117]:
advert = pd.read_csv('Advertising.csv')
print(advert)

        TV  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [118]:
#11.ii) Print first five records of dataset.

In [119]:
advert.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [120]:
#11.iii) print last five records from dataset.

In [121]:
advert.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [122]:
#11.iv) display the columns inside the dataset.

In [123]:
advert.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [124]:
#11.v) display last three records from dataset.

In [125]:
advert.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [126]:
#11.vi) display the information about the dataset and analyse the data.

In [127]:
advert.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [128]:
#11.vii) display types of each columns.

In [129]:
print(advert.dtypes)

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [130]:
#11.viii) check for null values in the dataset and display the sum of null values inside the column.

In [131]:
advert.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [132]:
#11.ix) drop a column 'radio' from a dataset and display first ten records.

In [133]:
advert_df = advert.drop('radio', axis=1)

In [134]:
print(advert_df.head(10))

      TV  newspaper  sales
0  230.1       69.2   22.1
1   44.5       45.1   10.4
2   17.2       69.3    9.3
3  151.5       58.5   18.5
4  180.8       58.4   12.9
5    8.7       75.0    7.2
6   57.5       23.5   11.8
7  120.2       11.6   13.2
8    8.6        1.0    4.8
9  199.8       21.2   10.6

In [135]:
#11.x) increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [136]:
advert_df['updated_sales'] = advert_df['sales'] * 0.10

In [137]:
advert_df.head()

      TV  newspaper  sales  updated_sales
0  230.1       69.2   22.1           2.21
1   44.5       45.1   10.4           1.04
2   17.2       69.3    9.3           0.93
3  151.5       58.5   18.5           1.85
4  180.8       58.4   12.9           1.29

In [138]:
#11.xi) display shape of data.

In [139]:
print(advert_df.shape)

(200, 4)

In [140]:
#11.xii) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [141]:
print(advert_df.max())

TV               296.4
newspaper        114.0
sales             27.0
updated_sales      2.7
dtype: float64

In [142]:
print(advert_df.min())

TV               0.70
newspaper        0.30
sales            1.60
updated_sales    0.16
dtype: float64

In [143]:
print(advert_df.mean())

TV               147.04250
newspaper         30.55400
sales             14.02250
updated_sales      1.40225
dtype: float64

In [144]:
print(advert_df.median())

TV               149.75
newspaper         25.75
sales             12.90
updated_sales      1.29
dtype: float64

In [145]:
print(advert_df.std())

TV               85.854236
newspaper        21.778621
sales             5.217457
updated_sales     0.521746
dtype: float64

In [146]:
#11.xiii) describe the dataset.

In [147]:
advert_df.describe()

               TV   newspaper       sales  updated_sales
count  200.000000  200.000000  200.000000     200.000000
mean   147.042500   30.554000   14.022500       1.402250
std     85.854236   21.778621    5.217457       0.521746
min      0.700000    0.300000    1.600000       0.160000
25%     74.375000   12.750000   10.375000       1.037500
50%    149.750000   25.750000   12.900000       1.290000
75%    218.825000   45.100000   17.400000       1.740000
max    296.400000  114.000000   27.000000       2.700000

In [153]:
#12.i) Read the dataset "Salaries.csv" in dataframe.

In [154]:
sal_df = pd.read_csv('Salary_Data.csv')
print(sal_df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [155]:
#12.ii) display first five records.

In [156]:
sal_df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [157]:
#12.iii) display first ten records.

In [158]:
sal_df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [159]:
#12.iv) display last five records.

In [160]:
sal_df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [161]:
sal_df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [162]:
#12.vi) display the columns inside the dataset.

In [163]:
sal_df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [164]:
#12.vii) display shape of data.

In [165]:
sal_df.shape

(33, 2)

In [166]:
#12. viii) describe the dataset.

In [167]:
sal_df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [168]:
#12. ix) display the information about the dataset and analyse the data.

In [169]:
sal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [170]:
#12. x) display types of each columns.

In [174]:
print(sal_df.dtypes)

YearsExperience    float64
Salary               int64
dtype: object

In [175]:
#12. xi) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [176]:
print(sal_df.max())

YearsExperience        13.0
Salary             156000.0
dtype: float64

In [177]:
print(sal_df.min())

YearsExperience        1.1
Salary             37731.0
dtype: float64

In [178]:
print(sal_df.mean())

YearsExperience        5.921212
Salary             82760.303030
dtype: float64

In [179]:
print(sal_df.median())

YearsExperience        5.1
Salary             67938.0
dtype: float64

In [180]:
print(sal_df.std())

YearsExperience        3.342413
Salary             34014.620992
dtype: float64